tests/perf/jmeter/rest_graphql_comparison.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="REST vs GraphQL Comparative Benchmarking" enabled="true">
      <stringProp name="TestPlan.comments">Comprehensive comparison of REST vs GraphQL approaches</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Global Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">graphql</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="FRAMEWORKS" elementType="Argument">
            <stringProp name="Argument.name">FRAMEWORKS</stringProp>
            <stringProp name="Argument.value">fraiseql,strawberry,graphene,fastapi-rest,flask-rest</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">http://host.docker.internal</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORTS" elementType="Argument">
            <stringProp name="Argument.name">PORTS</stringProp>
            <stringProp name="Argument.value">fraiseql:4000,strawberry:8001,graphene:8002,fastapi-rest:8003,flask-rest:8004</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- Setup Thread Group -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Framework Setup" enabled="true">
        <stringProp name="TestPlan.comments">Initialize and warm up all frameworks</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1</longProp>
        <longProp name="ThreadGroup.end_time">1</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Initialize Frameworks" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">def frameworks = vars.get("FRAMEWORKS").split(",")
def ports = [:]
vars.get("PORTS").split(",").each { pair ->
    def parts = pair.split(":")
    ports[parts[0]] = parts[1]
}

frameworks.each { framework ->
    def port = ports[framework]
    def protocol = vars.get("PROTOCOL")
    def url = "${vars.get('BASE_URL')}:${port}"

    // Adjust URL based on protocol and framework
    if (protocol == "rest") {
        if (framework.contains("rest")) {
            url += "/ping"
        } else {
            url += "/graphql"
        }
    } else {
        url += "/graphql"
    }

    // Wait for framework to be ready
    def ready = false
    def attempts = 0
    while (!ready &amp;&amp; attempts &lt; 30) {
        try {
            def connection = new URL(url).openConnection()
            connection.setRequestMethod("GET")
            if (connection.getResponseCode() == 200) {
                ready = true
                log.info("Framework ${framework} is ready on port ${port}")
            }
        } catch (Exception e) {
            log.debug("Framework ${framework} not ready yet: ${e.message}")
        }
        attempts++
        sleep(2000)
    }

    if (!ready) {
        log.error("Framework ${framework} failed to start within timeout")
    }
}</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- Simple Operations Benchmark -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Simple Operations Benchmark" enabled="true">
        <stringProp name="TestPlan.comments">Level 1: Protocol overhead and basic operations</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="Loop Controller" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1000</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1</longProp>
        <longProp name="ThreadGroup.end_time">1</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Framework Iterator" enabled="true">
          <stringProp name="filename">datasets/frameworks_all.csv</stringProp>
          <stringProp name="variableNames">framework_name,framework_port</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <IfController guiclass="IfControllerGui" testclass="IfController" testname="GraphQL Protocol" enabled="true">
          <stringProp name="IfController.condition">${PROTOCOL} == graphql</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GraphQL Ping" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="GraphQL Ping Payload" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="HTTPArgument" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{"query": "{ ping }"}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(BASE_URL,localhost)}</stringProp>
            <stringProp name="HTTPSampler.port">${framework_port}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/graphql</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <IfController guiclass="IfControllerGui" testclass="IfController" testname="REST Protocol" enabled="true">
          <stringProp name="IfController.condition">${PROTOCOL} == rest</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="REST Ping" enabled="true">
            <stringProp name="HTTPSampler.domain">${__P(BASE_URL,localhost)}</stringProp>
            <stringProp name="HTTPSampler.port">${framework_port}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/ping</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Success Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="51818">pong</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
      </hashTree>

      <!-- Complex Operations Benchmark -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Complex Operations Benchmark" enabled="true">
        <stringProp name="TestPlan.comments">Level 3: Complex operations with relationships</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">200</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <longProp name="ThreadGroup.start_time">1</longProp>
        <longProp name="ThreadGroup.end_time">1</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Framework Iterator" enabled="true">
          <stringProp name="filename">datasets/frameworks_all.csv</stringProp>
          <stringProp name="variableNames">framework_name,framework_port</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="User IDs" enabled="true">
          <stringProp name="filename">datasets/user_ids.csv</stringProp>
          <stringProp name="variableNames">user_id</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <IfController guiclass="IfControllerGui" testclass="IfController" testname="GraphQL Complex" enabled="true">
          <stringProp name="IfController.condition">${PROTOCOL} == graphql</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GraphQL Complex Query" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="GraphQL Complex Payload" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="HTTPArgument" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{"query": "query GetUser($id: ID!) { user(id: $id) { id username firstName lastName bio posts { id title comments { id content author { username } } } } }", "variables": {"id": "${user_id}"}}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(BASE_URL,localhost)}</stringProp>
            <stringProp name="HTTPSampler.port">${framework_port}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/graphql</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <IfController guiclass="IfControllerGui" testclass="IfController" testname="REST Aggregated Complex" enabled="true">
          <stringProp name="IfController.condition">${PROTOCOL} == rest</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="REST Aggregated Complex" enabled="true">
            <stringProp name="HTTPSampler.domain">${__P(BASE_URL,localhost)}</stringProp>
            <stringProp name="HTTPSampler.port">${framework_port}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/users/${user_id}?include=posts,posts.comments,posts.comments.author</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- Results Configuration -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/rest_graphql_comparison.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- HTML Report Generator -->
      <ResultCollector guiclass="ReportGenerator" testclass="ResultCollector" testname="REST vs GraphQL HTML Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/html/rest_graphql_comparison/</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>